{
  "songs": [
    {
      "id": 1,
      "title": "Blurred Lines",
      "artist": "Robby Rob",
      "src": "assets/track1.mp3",
      "cover": "assets/cover1.jpg",
      "story": "The city lights blurred into neon streaks as the train hummed past sleeping neighborhoods. He leaned back in the seat, earbuds in, watching strangers drift on and off like passing chapters. Every stop was a chance to wonder where they were headed, who they were waiting for, what music kept them alive inside. His own reflection in the window looked like a ghost, floating above the blur of the city. The beat in his ears kept time with the rumble of the wheels, reminding him that even if you don’t know the destination, sometimes the ride itself is the point.."
    },
    {
      "id": 2,
      "title": "Fine Girl",
      "artist": "Andrew Bandrew",
      "src": "assets/track2.mp3",
      "cover": "assets/cover2.jpg",
      "story": "She sat by the window in a yellow hoodie, headphones on, nodding to beats no one else could hear. Outside, the rain traced restless rivers down the glass, each drop catching the glow of streetlights. Her phone buzzed on the table, unanswered, as her mind wandered through memories stitched together by melodies. Everyone called her “fine girl,” admiring the surface, but no one knew the quiet storms behind her calm smile—the restless ache for something real, something lasting, something more than small talk and empty promises.."
    },
    {
      "id": 3,
      "title": "Let Her Go",
      "artist": "Letter L",
      "src": "assets/track3.mp3",
      "cover": "assets/cover3.jpg",
      "story": "He held onto the last text like it was an anchor, scrolling up and down, searching for a hidden meaning in her words. The playlist she once made for him still lived in his library, each song a timestamp of better days. Sometimes he let it play, other times he skipped the tracks too heavy to carry. The thought of deleting it felt like erasing a piece of himself—the version that laughed freely, that believed in forever. To let her go wasn’t just about her; it was about letting go of who he was when he still had her.."
    },
    {
      "id": 4,
      "title": "Guitar Strings",
      "artist": "String Master",
      "src": "assets/track4.mp3",
      "cover": "assets/cover4.jpg",
      "story": "His old guitar leaned against the wall, strings rusted but still holding the memory of songs once played in crowded rooms. Every strum now brought back voices from late nights that ended in laughter, secrets, and promises too fragile to last. The house was quiet, but the air was thick with echoes—ghosts of the past humming between the walls. He played anyway, for no one but himself, letting the notes spill into the cracked window, where his reflection nodded back. Maybe no one else was listening, but the music still carried pieces of everything he lost, and everything he still hoped to find.."
    },
    {
      "id": 5,
      "title": "Rooftop Five",
      "artist": "Skyline Beats",
      "src": "assets/track5.mp3",
      "cover": "assets/cover5.jpg",
      "story": "She climbed twelve flights of stairs just to find silence above the chaos. The rooftop was her escape—a place where stars peeked through the haze and the city buzzed like a low drumline below. A small speaker spilled soft Lofi loops into the night, blending with the rhythm of car horns and distant sirens. Up there, she could breathe. The weight of expectations, of days that didn’t make sense, of words she never said—all of it loosened in the open air. For a few stolen hours, the rooftop wasn’t just a view; it was freedom, the kind you couldn’t buy or explain.."
    }
  ]
}
